first round of updates
